In [2]:
import numpy as np
import pandas as pd

path = "weight-height.csv"
df = pd.read_csv(path)
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [6]:
df.isnull()
df.isnull().sum()

Gender    0
Height    0
Weight    0
dtype: int64

In [8]:
df1 = pd.DataFrame(df[['Gender', 'Height', 'Weight']])
df1.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [9]:
df2 = pd.DataFrame(df[['Gender' , 'Height' , 'Weight']])
df2.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [12]:
df3 = pd.merge(df1,df2,on="Gender")
df3.head()

  Gender   Height_x    Weight_x   Height_y    Weight_y
0   Male  73.847017  241.893563  73.847017  241.893563
1   Male  73.847017  241.893563  68.781904  162.310473
2   Male  73.847017  241.893563  74.110105  212.740856
3   Male  73.847017  241.893563  71.730978  220.042470
4   Male  73.847017  241.893563  69.881796  206.349801

In [13]:
df3 = pd.merge(df1,df2,on="Gender" , how="inner")
df3.head()
df3 = pd.merge(df1,df2,on="Gender" , how="outer")
df3.head()  
df3 = pd.merge(df1,df2,on="Gender" , how="left")
df3.head() 
df3 = pd.merge(df1,df2,on="Gender" , how="right")
df3.head()

  Gender   Height_x    Weight_x   Height_y    Weight_y
0   Male  73.847017  241.893563  73.847017  241.893563
1   Male  68.781904  162.310473  73.847017  241.893563
2   Male  74.110105  212.740856  73.847017  241.893563
3   Male  71.730978  220.042470  73.847017  241.893563
4   Male  69.881796  206.349801  73.847017  241.893563

In [14]:
groupDf = df3.groupby("Gender")
print(groupDf)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x10af90a40>

In [17]:
print(groupDf.get_group('Male'))

         Gender   Height_x    Weight_x   Height_y    Weight_y
0          Male  73.847017  241.893563  73.847017  241.893563
1          Male  68.781904  162.310473  73.847017  241.893563
2          Male  74.110105  212.740856  73.847017  241.893563
3          Male  71.730978  220.042470  73.847017  241.893563
4          Male  69.881796  206.349801  73.847017  241.893563
...         ...        ...         ...        ...         ...
24999995   Male  68.860062  177.131052  70.351880  198.903012
24999996   Male  68.973423  159.285228  70.351880  198.903012
24999997   Male  67.013795  199.195400  70.351880  198.903012
24999998   Male  71.557718  185.905909  70.351880  198.903012
24999999   Male  70.351880  198.903012  70.351880  198.903012

[25000000 rows x 5 columns]

In [20]:
df4 = pd.concat([df1,df2] , axis=1)
print(df4)

      Gender     Height      Weight  Gender     Height      Weight
0       Male  73.847017  241.893563    Male  73.847017  241.893563
1       Male  68.781904  162.310473    Male  68.781904  162.310473
2       Male  74.110105  212.740856    Male  74.110105  212.740856
3       Male  71.730978  220.042470    Male  71.730978  220.042470
4       Male  69.881796  206.349801    Male  69.881796  206.349801
...      ...        ...         ...     ...        ...         ...
9995  Female  66.172652  136.777454  Female  66.172652  136.777454
9996  Female  67.067155  170.867906  Female  67.067155  170.867906
9997  Female  63.867992  128.475319  Female  63.867992  128.475319
9998  Female  69.034243  163.852461  Female  69.034243  163.852461
9999  Female  61.944246  113.649103  Female  61.944246  113.649103

[10000 rows x 6 columns]

In [22]:
df5 = pd.concat([df1,df2] , axis=0)
print(df5)

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[20000 rows x 3 columns]